app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("title", "created_at", "updated_at", "parent_category_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Dessert"], ["created_at", 2017-02-18 21:40:50 UTC], ["updated_at", 2017-02-18 21:40:50 UTC], ["parent_category_id", 1]]