app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    if @group.save
---
INSERT INTO "groups" ("name", "protected", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "josgroup"], ["protected", true], ["created_at", 2017-02-18 16:55:49 UTC], ["updated_at", 2017-02-18 16:55:49 UTC]]