app/controllers/meals_controller.rb

INSERT INTO "meals" ("name", "image", "price_person", "date", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @meal = Meal.new(meal_params)

    if @meal.save

DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 1]]
---
  def destroy
    @meal.destroy

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_meal
      @meal = Meal.find(params[:id])