app/controllers/notification_types_controller.rb

  def index
    @notification_types = NotificationType.all
---
SELECT "notification_types".* FROM "notification_types"

  def create
    @notification_type = NotificationType.new(notification_type_params)

    if @notification_type.save
---
INSERT INTO "notification_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Join"], ["created_at", 2017-02-18 18:54:45 UTC], ["updated_at", 2017-02-18 18:54:45 UTC]]