app/controllers/notifications_controller.rb

  def index
    @notifications = Notification.all
---
SELECT "notifications".* FROM "notifications"

  def create
    @notification = Notification.new(notification_params)

    if @notification.save
---
INSERT INTO "notifications" ("date", "message", "created_at", "updated_at", "user_id", "type_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", 2017-02-18 19:58:44 UTC], ["message", "Jos quiere unirse a tu grupo"], ["created_at", 2017-02-18 19:58:44 UTC], ["updated_at", 2017-02-18 19:58:44 UTC], ["user_id", 1], ["type_id", 1]]