app/controllers/order_requests_controller.rb

SELECT "order_requests".* FROM "order_requests"
---
  def index
    @order_requests = OrderRequest.all

INSERT INTO "order_requests" ("quantity", "created_at", "updated_at", "user_id", "status_id", "publication_id", "meal_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["quantity", 3], ["created_at", 2017-02-19 12:26:33 UTC], ["updated_at", 2017-02-19 12:26:33 UTC], ["user_id", 1], ["status_id", 1], ["publication_id", 1], ["meal_id", 1]]
---
  def create
    @order_request = OrderRequest.new(order_request_params)

    if @order_request.save