app/controllers/order_statuses_controller.rb

  def index
    @order_statuses = OrderStatus.all
---
SELECT "order_statuses".* FROM "order_statuses"

  def create
    @order_status = OrderStatus.new(order_status_params)

    if @order_status.save
---
INSERT INTO "order_statuses" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "pending"], ["created_at", 2017-02-18 23:48:00 UTC], ["updated_at", 2017-02-18 23:48:00 UTC]]