app/controllers/publications_controller.rb

  def index
    @publications = Publication.all
---
SELECT "publications".* FROM "publications"

  def create
    @publication = Publication.new(publication_params)

    if @publication.save
---
INSERT INTO "publications" ("setDate", "deadline", "meetingPoint", "created_at", "updated_at", "user_id", "meal_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @publication.destroy
---
DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 1]]