app/controllers/ratings_controller.rb

  def create
    @rating = Rating.new(rating_params)

    if @rating.save
---
INSERT INTO "ratings" ("evaluation", "created_at", "updated_at", "user_id", "meal_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["evaluation", 4], ["created_at", 2017-02-18 23:41:45 UTC], ["updated_at", 2017-02-18 23:41:45 UTC], ["user_id", 1], ["meal_id", 1]]