app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)

    if @tag.save
---
INSERT INTO "tags" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "#Halal"], ["created_at", 2017-02-18 20:02:47 UTC], ["updated_at", 2017-02-18 20:02:47 UTC]]